{"meta":{"title":"babo's hexo","subtitle":"hexo test","description":"","author":"babo","url":"https://babosam.net","root":"/"},"pages":[],"posts":[{"title":"hexo놈..폰트변경","slug":"20200405-hexo_nom","date":"2020-04-04T17:10:29.650Z","updated":"2020-04-04T18:05:04.874Z","comments":true,"path":"2020/04/05/20200405-hexo_nom/","link":"","permalink":"https://babosam.net/2020/04/05/20200405-hexo_nom/","excerpt":"","text":"이 녀석이 자꾸만 내 시간을 갉아 먹는 것 같이 느껴지는 건 내 착각일까? 1. 폰트 변경1. 출처: #d2fault&lt;변경할 부분 1&gt; [블로그 루트 디렉토리]/themes/hueman/layout/common/head.ejs 1234&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"\"&gt;&lt;%- css('https://cdn.rawgit.com/innks/NanumSquareRound/master/nanumsquareround.css') %&gt; &lt;%- css('https://fonts.googleapis.com/earlyaccess/nanumgothiccoding.css') %&gt;&lt;%- css('css/style') %&gt; &lt;변경할 부분2&gt; [블로그 루트 디렉토리]/themes/hueman/source/css/_variables.styl font-sans가 본문폰트, font-mono가 코드 블록내의 폰트란다. 123456// Fontsfont-sans = 'Montserrat', \"NanumSquareRound\", \"Malgun Gothic\", \"맑은 고딕\", \"돋움\", dotum, sans-serif//font-sans = \"Titillium Web\", \"Helvetica Neue\", Helvetica, Arial, \"Microsoft Yahei\", sans-seriffont-serif = Georgia, \"Times New Roman\", seriffont-mono = \"Nanum Gothic Coding\", \"NanumSquareRound\", Consolas, monospace//font-mono = \"Source Code Pro\", Consolas, Monaco, Menlo, Consolas, monospace 2. 적용 head.ejs에서는 &lt;head&gt;끝에 아래를 추가해 줬고. 1234&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"\"&gt; &lt;%- css('https://cdn.jsdelivr.net/font-iropke-batang/1.2/font-iropke-batang.css') %&gt; &lt;%- css('https://fonts.googleapis.com/earlyaccess/nanumgothiccoding.css') %&gt; &lt;%- css('css/style') %&gt; _variables.styl에서는 font-sans하고 font-mono 에서는 아래 내용을 수정해 줬다. 12345font-sans = \"Iropke Batang\", \"Helvetica Neue\", Helvetica, Arial, \"Microsoft Yahei\", sans-serif//font-sans = \"Titillium Web\", \"Helvetica Neue\", Helvetica, Arial, \"Microsoft Yahei\", sans-seriffont-serif = Georgia, \"Times New Roman\", seriffont-mono = \"Nanum Gothic Coding\", \"Iropke Batang\", Monaco, Menlo, Consolas, monospace//font-mono = \"Source Code Pro\", Consolas, Monaco, Menlo, Consolas, monospace 근데 이게 로컬이나 퍼블릭 폴더단독에서는 안먹는다 ㅋㅋ 뭐지? github 에서만 먹는다. 출처 블로그 말미에 이런 말이 적혀있다. localhost에서는 보이는데 블로그로 접속하면 안 보인다면?높은 확률로 캐시 때문에 일어난 문제. 브라우저 캐시 날리면 됩니다. ^^b그래도 안 된다면? 폰트 이름 맨 뒤에 세미콜론 붙이신 건 아닌지 확인해 주세요. 암튼 그것 때문인 듯.. 크롬으로 들어갔었는데.. 마소엣지로 들어가니 바뀌어 보인다. ㅋㅋ 해결~ 2. 맥에서 시각 입력출처: 얼반부산맥 automator를 이용하여 만드는건데 형식이 맞질 않는다. 블로그 쓸 때 넣을 건데 이 형식 어떻게 바꾸는지 모르겠는데. 알아봐야지 뭐. 쩝.~","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://babosam.net/tags/hexo/"},{"name":"웹폰트","slug":"웹폰트","permalink":"https://babosam.net/tags/%EC%9B%B9%ED%8F%B0%ED%8A%B8/"},{"name":"수정사항","slug":"수정사항","permalink":"https://babosam.net/tags/%EC%88%98%EC%A0%95%EC%82%AC%ED%95%AD/"},{"name":"시각입력","slug":"시각입력","permalink":"https://babosam.net/tags/%EC%8B%9C%EA%B0%81%EC%9E%85%EB%A0%A5/"},{"name":"맥","slug":"맥","permalink":"https://babosam.net/tags/%EB%A7%A5/"}]},{"title":"이 수업이 네 수업이냐?","slug":"2020-03-22-isthisyourcourse","date":"2020-03-21T15:00:00.000Z","updated":"2020-04-04T19:58:15.027Z","comments":true,"path":"2020/03/22/2020-03-22-isthisyourcourse/","link":"","permalink":"https://babosam.net/2020/03/22/2020-03-22-isthisyourcourse/","excerpt":"","text":"이 수업이 네 수업이냐?1. 보지 않으려 했는데.. 띵동, 밴드의 알람이 왔다. 달빛샘이 원래대로라면 작년을 정리하는 날일거라며 준비했다는 글을 올리신 내용이다. 참 이런 것도 챙기시는 달빛샘. 이라는 생각으로 폰으로 열었다가 한 문단 읽고선 ‘지금 멈추지 못하면 끝까지 읽겠다’하고는 멈추고 나도 뭔가 해야 하는데, 뭔가 생각을 가지고 그다음에 읽어야 휩쓸리지 않을텐데 하는 걱정을 하며 하다 중단한 기초분석을 뒤적거려보지만 별 진전이 없었다. 그러던 와중에 성원샘의 댓글 알람이 울리고 ‘그래 다운이라도 받아놔야겠다.’ 하면서 다운 받아 잠깐 읽는다는 것이 정신 차리고 보니 19쪽이었다. “나는 비로소 수업을 구조 속에서 보는 게 무엇인지 이 과정에서 깨달을 수 있었다.” 과감한 선언이다. 어떻게 이렇게 말할 수 있지? 뭔가 다 알았다는 말 같다. 이 말이 내 머리에 푹 꽂혔다. 정말? 그런게 가능한가? 하는 심정으로 글을 따라 갔던 것 같다. 2. 깨달은 것은 가치에 관한 것인가? 나는 달빛샘이 연수를 진행하면서 깨달았다는. ‘수업을 구조 속에서 본다는 것이 무엇인지’가 궁금했다. 그리고 그걸 어떻게 깨달았을까? 궁금해 하며 글을 읽었다. 수업을 구조 속에서 본다. 나의 경우 이 말을 하나의 에피소드를 기초분석-이것도 작은 단위의 구조(?)-하여 수업을 구성하는 전체 구조를 파악한다는 정도로 이해하며 공부했던 기억이 있다. 그리고 수업을 좀 더 잘 이해할 수 있게 도와주는 그런 용도의 혹은 그런 필요에 부합하는 방법이나 도구 정도로 말이다. 어떻게 보면 나는 용도, 방법, 필요 등등의 ‘수업을 구조 속에서 본다는 것의’ 가치의 관점에서 이해했던 것 같다. 달빛샘의 글을 읽으면서 신기했달까? 새로웠달까? 음. 뭔가. 바람이 부는 것 같은 느낌이 들었던 것은 연수 전 사전 응답 설문을 받는 것이었다. 그것을 통해 연수할 집단의 지향을 분석하는 과정이었다. 내가 오래 전 멋모르고 연수하던 때엔 그냥 그곳의 대충의 분위기, 혹은 사정 등을 알고 가면 될거라고 생각했었는데 사전에 이렇게 설문하고 분석하면 클라이언트(?) 생각의 중심을 볼 수도 있겠다는 생각이 들었다. 글에서 앞 부분에는 (수업을)보아야 하고 보고 싶지만 볼 수 없는 중학교의 이야기와 (수업을)보고싶지도 않고 필요도 없는데 보자고 하는 초등학교의 이야기가 나온다. 기초분석틀을 이용하여 분석하고 이를 근거로 전개해 나가는 이야기가 내게 매우 설득력 있게 다가왔다. 이런 아이러니 속에서 수업 보기는 이제 끝났다는 말이 실감이 났다. 그리고 그런 분석 과정에서 교사가 생각하는 성장이란 결국 목표 도달과 같은 말이라는 것, 목표 도달을 잘 이루려면 교사가 잘 전달하고 학생이 그것을 잘 따르면 도달할 수 있다는 생각, 아니 믿음으로 연결되는 논리적 고리를 찾아내는 과정을 보며 날에 베일 것 같은 날카로움을 느꼈다. 그럼에도 이러한 논리들이 결국 지극히 평범하게 느껴지는 것은 그것이 공기처럼 나를 둘러싼 생각이기도 하거니와 나 역시도 부딪히고 있는 거대한 벽같은 문화임을 다시 한 번 확인하게 되었다. 기초 분석을 통해 그냥 일상적인 구호나 공허한 외침이 아닌 현실에 박힌 실체를 확연하게 드러낸 것 같다. 아이를 볼 수도 없고 볼 필요도 없다. 이것이 나를 둘러싼 그리고 나의 현실이다. 하지만 달빛샘은 유치원 연수를 통해서 새로운 희망도 이야기 하신다. 바로 유치원의 개정된 누리교육과정이다. 달빛샘이 열심히 공부한 2019 개정 누리과정은 충격이었다고 전한다. 그러면서 우리의 연수 중 나왔던 대안들이 2019 개정 누리과정을 통해 현신했다고 까지 말한다. 우리가 하려던 것은 상대를 바꾸려는 것이 아니라 내가 다가가는 것……. ..교사가 20개의 계획을 짜야 하는 것이 아니다. 교사가 한 명씩 차근차근 유아에게 다가가 아이마다의 놀이 경험을 찾고 일단 거기에서 부터 한 걸음을 나아가자는 거지….. 바뀌어야 한다면 내가 변하는 것이고 할 수 있는 것부터 차근 차근 하는 것이다. 그러면서 한 걸음씩 아이에게 다가가는 것이다. 그것을 위해 연수를 하며 유치원 선생님들을 통해 새로운 희망을 보고 눈물도 짓는다. 그리고 그러지 못한 말 뿐인 혁신학교에 대해 이렇게 말하며 내가 원하는 활동을 계획하고 실행하는데 빠져 아이를 보는 일을 놓아 버린 혁신학교의 교사들이 얼마나 많은가! 이 글을 마무리 하려고 한다. 참 감동적이다. 하지만.. 이러면 안 된다. 내가 궁금하던 ‘무엇인지’는 어디서 찾아야 한단 말인가? 수업을 구조 속에서 본다는 게 무엇인지 말해줘야지. 하며 글을 놓지 못하고 마지막 페이지를 넘기지 못했지만 글은 어느새 “유아의 유능함”을 이야기 하면서 내 스스로 내가 아이로 부터 멀어졌다고 살짝 일러주며 사라진다. 글이 끝나자 나는 머릿 속에 있던 내용으로라도 어떻게 해보려고 머리를 굴려보았다. 그렇다면 수업을 구조속에서 본다는 것은 무엇인가? 여기 유치원에서 보면 놀이를 구조속에서. 본다는 것은 무엇인가? 그 세계를 탐구한다는 것으로 마무리 된건가? 그걸 찾기가 어렵다. 명시적으로 나오지 않은 걸까? 아니면 내가 못 찾은 걸까? 그럼 나는 이걸 가지고 기초분석을 해 봐야하나? 할 수나 있을까? 그럼 실마리 행위부터 찾아야하나? 실마리 행위를 뭘로 잡을 수 있을까? 깨달았다.로 잡고 하면 환경은 유치원 연수일 가능성이 크고 역량은 충분하고 자아는 강사로의 참여일 것이다. 그것이 지향으로 가진 않았을 것 같은데 그렇다면 지향은 연수를 잘 하는 것인가? 깨달았다가 의도적인 뭔가가 아니라 그냥 나온 것이라면 마치 감정과 감탄과 같은 그런 반응이라면 기초 분석 틀로 해도 석연치 않을 것 같다는 생각이 들었다. 그럼 어떻게 해야 할까? 전반적인 흐름을 한 번 봐야 할까? &lt;글의 제목과 소제목들&gt; 보면 바뀔지도.. 바뀌어야 볼지도.. 수업보기의 종말 1.1. 보아야 하고, 보고 싶지만, 볼 수 없는 1.2. 보고 싶지도 않고, 필요도 없는데, 보자고 하는 새로운 교육과정의 서막: 아이를 보는 길이 열릴까? 2.1. 보아야 하고, 보고 싶으나, 방법을 모르는 ​ 2.1.1. 첫째 날: 한 아이 중심의 관찰과 분석 ​ 2.1.2. 둘째 날: 유아와 살아봅시다. 2.2. 관성을 이기려면 음속의 돌파가! 소제목들만 보면 수업보기의 종말인 세상에서 하나의 희망을 발견한 저자의 기쁨을 나누는 것 같은 모양새다. 그것을 발견할 수 있었던 것은 ‘’수업을 구조속에서 보는 것’을 시도했기 때문이고 그것을 잘 따랐기 때문인 것 같다.(잘 전달하고 잘 따르고의 형식인가?) 수업이 유치원에서는 놀이일 것이고. 그 과정에서-이 과정이란 중등, 초등, 유치원의 연수를 준비하고 연수 하는 과정을 이야기 하는 것 같다-수업을 구조 속에서 보는 것의 의미를 깨달았다. 수업을 구조 속에서 보면 수업을 보아야 하는 이유가 보인다. 그래서 바뀐다. 보면 바뀔지고.. 바뀌어야 볼지도.. 라는 제목은 수업을 구조 속에서 보면 교사가 바뀔지도 혹은 교사가 바뀌어야 수업을 구조속에서 볼지도.라는 의미의 제목일까? 그래서 수업을 구조속에서 본다는 것이 교사를 바꾸게 하는 원인이기도 하면서 그 결과이기도 하다는 그런 의미인가? 아직 명확하진 않다. ‘수업을 구조 속에서 보는 것이 과연 교사들에게 수업을 이해하는 길이 되어 줄까? 교사는 무엇을 깨닫고, 무엇을 행하게 될까?’ 첫 문단에 나오는 이 말은 수업을 구조속에서 본다고 교사가 수업을 이해할 수 있겠어? 혹은 구조속에서 보면 뭔가 바뀔까? 하는 의구심을 가졌다는 말이고 결말은 거기에서 탈출했다는 의미일까? 왜 수업을 구조 속에서 보는 것이 필요한지 알게 되었다는 말은 수업 이해가 왜 필요한지 깨닫게 되었다는 말과 비슷해 보인다. 구조 속에서 봐야 수업을 이해할 수 있다라는 말 인것 같다. 글을 다시 한번 읽어 보며 어쩌면 ‘무엇이’라는 말이 가치 내지는 효용성의 뜻으로 사용되었을 수도 있겠다는 생각을 하게 된다. 그래서 수업을 구조속에서 보는 것의 필요성을 깨닫게 되었다. 혹은 수업을 구조 속에서 보는 가치를 깨닫게 되었다라는 말고 바꿀 수도 있을 것 같다. 하지만 내가 궁금했던 것은-달빛샘이 찾았다고 해서-수업을 구조 속에서 본다는 것을 달빛샘은 어떻게 이해했느냐였다. 가치보다는 뜻이나 의미에 가깝다. 그럼 달빛샘의 이 글에서는 달빛샘이 수업을 구조 속에서 본다는 것의 가치와 중요성을 깨닫게 된 경험만 알 수 있는 걸까? 3. 깨달은 것은 해석한 결과 아닐까? 개학하면 나도 아이들을 보게 될 것이다. 하지만 두려움이 앞선다. 아이들을 보면서 그 세계를 이해하고 그와 발맞춰 나갈 수 있을까? 내가 준비한 여러 가지 계획들을 수정하거나 과감히 팽개치면서 아이의 발걸음을 따라갈 수 있을까? 그것을 기록할 수 있을까? 그러기 위해 나는 무엇을 준비하고 있나? 하는 쓸데 없는 생각들. 하려면 나는 무엇을 해야 하는가? 보아야 하는데 보려면 나는 무엇을 해야 하는가? 현안에, 닥치는 일에 쉽게 매몰되는 내가 무엇을 해야 하는가? 무엇을 준비해야 하는가?하는 잡 생각들을 해 보며 문득 다른 생각이 났다. 수업을 구조속에서라는 말가운데 ‘수업’은 나의 수업이 아닌 아이의 수업일 것이다. 내가 한 수업을 보는 것이 아니다. 만약 내가 한 수업을 본다면 나를 보겠지. 아이를 봐야 아이를 이해하고 그의 수업을 이해하게 될 것이다. 예전에 주고 받는 수업授業이 아니라 뭔갈 해나가는 수업修業. 그러면서 톱밥을 얻는. 그런 것이 수업이라고 사부님의 글에서 본 것 같다. 거기에 비추어 보면 나는 지금까지 주는 수업을 하느라고, 나 하는 것에 바빠서 아이들을 보지 못했던 것 같다. 다른 말로 아이들의 수업을 보지 못한 것이다. 수업을 구조 속에서 본다는 것은 그동안 보지 못했던 아이들의 수업을, 그 구조를 보겠다는 시도인 것이다. 구조 속에서라는 말을 구조를 통해서라고 할 수 있을까? 혹은 구조를 활용하여? 혹은 구조 안에서? 갑자기 수업을 구조속에서라는 말이 뭔지 모르겠다. 처음 보는 것처럼 낯설게 느껴진다. 구조속에서가 무슨 말인가? ‘수업 이해하기’책을 한 번 봐야 겠다. 머릿말에 이런 말이 나온다. ‘.. 수업을 보려면 내 눈을 가져야 하고, 내 눈을 가지지 않으면 수업을 볼 수 없기 때문이다. 나는 이 모순을 극복하기 위한 방안으로서 학교의 수업 속에서 교사가 놓여 있는 상황을 구조적으로 파악하고, 그 구조 속에서 교사의 수업 행위를 해석하는 길을 찾았다. 내 눈, 또는 내가 옳다고 생각하는 이론에 의해서가 아니라 수업 자체의 구조에 의해서 수업의 의미가 저절로 해석되도록 한 것이다.’ 머릿말에 보면 구조 속에서라는 말은 구조에 의해서 수업의 의미가 드러난다는 것이고 그러기 위해 내 눈을 버려야 한다는 이야기다. 결국 내 눈 대신 구조를 내 눈 삼아 본다? 구조를 통해 조명한다? 구조를 통해 보면 이해할 수 있다는 말인가? 구조를 통해 본다는 것은 나를 내려 놓는 것이다? 나를 내려 놓으면 구조로 볼 수 있나? 구조를 파악해야 수업이 아이의 수업이 이해 되는거 아니었나? 구조 속에서 본다는 것은 아이의 수업을 구조속에서 본다는 것이다. 결국 아이를 드러내는 것이고 유아의 유능함이 드러나는 그것이 수업이다? 달빛샘의 글에 나온 ‘수업을 구조 속에서 본다는 것’은 나의 의도와 수업을 내려놓고 아이의 유능함을 드러내는 것이다.라고 정리할 수 있을까? 그런데 이 수업을 교사와 학생이 주고 받는 과정의 수업授業이 아닌 아이가 스스로 뭔가를 하는, 일하는 수업修業으로 본다면 내가 이미 아이의 수업속에 있는 것인데 - 나를 내려놓은 상태인데 - 굳이 구조 속에서 볼 필요가 있을까? 달리 말해서 수업을 구조속에서 본다는 것은 수업授業이 아닌 수업修業을 구조속에서 본 다는 것일 테고 그럴 때 아이가 드러나게 된다. 즉 아이의 수업, 아이와 수업이 따로 떨어져 있는 것이 아닌 아이가 수업인 셈이다. 아이가 수업을 통해 드러난다는 것이다. 아이가 아무것도 하지 않는다면(생각을 포함하여) 아이는 드러나지 않는다. 하지만 아이는 뭔갈 하면서 존재가 드러난다. 그리고 우리는 그것을 통해 아이를 본다. 아이의 수업을 본다는 것은 수업하는 그 아이를 본다는 것이다. 어쩌면 수업은 아이와 따로 떨어져 있는 것이 아니라 아이 그 자체인지도 모르겠다. 아이가 하는 그 모든 것이 수업이다. 그것을 그 구조속에서 보고 이해하고 아이에게 한 걸음 나가는 것이 내가 하려는 일이다. 나는 지금까지 나와 아이가 함께 하는 혹은 주고 받는 어떤 합(대련하듯이)이 수업이라고 생각했나보다. 신규때에는 내가 수업을 하면 아이를 내가 있는 곳으로 끌어 올려고 노력했고 수업이랑 놀자를 하면서는 나와 아이 사이의 중간 지대의 어떤 창고 혹은 관찰실을 마련하고 그곳으로 아이를 초청해 내 프로그램에 참여하게 하고 그것을 관찰하는 것이 수업 이해라고 생각했는지도 모르겠다. 하지만 이제 비로소 알았다. 아니 다른 생각을 하게 되었다. 아이가 하는 것이 수업이다. 아니 아이가 하는 것만이 수업이다. 그리고 내가 그에게로 가 그 속에 들어가야 수업이라고 부를 만한 것을 볼 가능성이 있다. 그렇다고 아이를 수업을 볼 수 있는 것은 아니다. 수업(아이)을 보기 위해 그 주변을 둘러싼 구조를 본다. 구조들을 파악해야 한다. 4. 깨져버린 허상 내가 예전에 교사에게 수업이 어떤 의미가 있는지에 대한 고민을 한다고 했던 기억이 있다. 중간까지 나는 수업은 나에게 공부다 라는 말로 정리를 했던 것 같다. 나를 공부하게 하는 가치를 지니고 있다는 뜻일 것 같기도 하고 수업은 이해를 해나가는 과정이라는 뜻으로 이야기 한것 같기도 하다. 그럼에도 불구한 아이마다의 수업이 있다. 주옥같은. 그것을 고고학자가 돌맹이 하나에 옛 역사를 음미하듯이 그 아이마다의 수업들을 찾아야 한다는 귀찮음이 있었다. 그래서 뭐. 나보고 하라고 하는 말이 나올 수 있었다. 하지만 이젠 내가 하는 그 모든 것이 수업이 아니라는, 수업에 대한 허상이 깨져버린 지금 나는 수업을 보려면 아이에게 들어갈 수 밖에 없게 되었다. 예전에는 아이마다의 수업도 있고 나와 하는 수업도 있고 하는 생각이었다면 지금은 나와 하는 수업은 없다이다. 그것은 수업이 아니다. 아이의 고유성을 살려주면서도 내가 가진 성취기준도 성취하도록 하는 그런 수업은 신기루였다는 생각이 든다. 물론 내가 그 구조의 한 부속이 되어 아이의 세계를 혹은 아이의 수업을 성취기준으로 몰아갈 수도 있겠지. 하지만 그와 동시에 아이의 비명도 듣겠지. 거기서 무엇을 선택할지는 내 몫일 것이다. 이렇게 보면 그 수업이라는 것은 평가의 대상은 아니다. 잘 했니 잘못했니가 아니라 이렇게 해서 그렇게 되었다. 라는 서술이 되어야 한다. 고유한 것이기에. 평가라는 것은 애초부터 뭔가와 비교를 하게 만든다. 고유한 것을 어떻게 비교할 수 있을까? 그냥 그 자체를 서술하는 것이 평가가 평가가 아닐까 하는 생각이 들었다. 어쩌면 지금의 평가-성취기준을 갖고 하는 평가-로 인해 수업을 하고서도 자꾸만 그 수업에서 빠져나올 수 밖에 없는 구조인지도 모르겠다. 그렇다면 이 평가는 어떻게 이루어져야 할까? 그럼 평가는 무엇인가? 평가가 필요한가? 교사가 적절한 반응을 했는지 안했는지가 평가 아닐까? 아이의 수업이라고 할 때 아이가 하는 것이 수업이라 할 때 평가는 지금 어디인지 점검하는 것일까? 좀 더 생각해 봐야겠다. 일단은 아이가 하는 것이 수업이다. 까지 왔다.","categories":[],"tags":[{"name":"달빛","slug":"달빛","permalink":"https://babosam.net/tags/%EB%8B%AC%EB%B9%9B/"},{"name":"토론문","slug":"토론문","permalink":"https://babosam.net/tags/%ED%86%A0%EB%A1%A0%EB%AC%B8/"},{"name":"연습","slug":"연습","permalink":"https://babosam.net/tags/%EC%97%B0%EC%8A%B5/"},{"name":"비움","slug":"비움","permalink":"https://babosam.net/tags/%EB%B9%84%EC%9B%80/"},{"name":"수업","slug":"수업","permalink":"https://babosam.net/tags/%EC%88%98%EC%97%85/"}]},{"title":"커맥의 재부팅 문제","slug":"2020-03-20-cumacreboot","date":"2020-03-19T15:00:00.000Z","updated":"2020-04-04T16:34:27.402Z","comments":true,"path":"2020/03/20/2020-03-20-cumacreboot/","link":"","permalink":"https://babosam.net/2020/03/20/2020-03-20-cumacreboot/","excerpt":"","text":"커맥이 깨어날 때 재부팅 된다. 자꾸만.### 증상 : 잠자기는 잘 됩니다. 문제는 깨어날 때 5초간 화면이 나오고 바로 재부팅됩니다. 이유가 뭘까? 하고는 대부분이 usb문제이기에 usb를 잡아보려고 노력했다. 하지만 제대로 잡혔다고 생각하는데 그게 잘 되지 않는다. 해킨툴로 해서 잡아보는데 이게 영 아니다. 그래서 문제가 있을까? 해서 보니 다른 문제가 있는 것 같다. 아무래도 안될 것 같아서 다른 사람의 config.plist를 찾아본다. 검색하던 중에 한 개를 찾는다. dominikzorgie’ github 적용해본다. oc를 해보려고 하는데 부팅이 잘 안된다. 뭔가 다른 구조인가보다. 나중에 해보기로 하고 일단 clover로 해 본다. 내컴 정보를 넣고 수정하고 넣어 본다. 된다. 와.. 이전 것 보다 usb가 완벽한 것 같은 느낌이 든다. 사실인지는 모르겠다. 붙었다 안붙었다 하던 키보드도 잘 붙는 것 같고 뭔가 다른 것 같다. 해서 이걸 쓰기로 하고 다른 것들 문제가 있는지 확인해 본다. 블루투스가 없어서 기존에 넣었던 것을 넣어 주었다. 그런데 문제는 여전하다. 재부팅. 그리고 이건 잠자기가 깊은 잠이 안되는 것 같다. 이유가 있는지는 모르겠지만. 깜박이지 않고 화면만 꺼지는건가? 아무튼 그렇다. 아니 금방 켜진다. 그리고 재부팅된다. dominikzorgie의 파일로 하니 재부팅되면 다음에 리포트가 나온다. 이걸 보니 뭐가 문제인지 확인할 수 있었다. 이게 안나와도 볼 수 있어야 하는데 아직 나는 그 정도는 아니다. 확인해 보니 일단은 [IGPU… 어쩌구 한다. 아. 내장 그래픽이 이상하구먼. 해서 내장 그래픽을 내가 가지고 있던 걸로 바꿔줬다. 그랬더니 그 오류는 안 난다. 흠.. 그런데 여전히 깨나면 재부팅. 이번엔 panic(cpu 0 caller 0xffffff8000a288b7): “AppleHDAHDMI_DPDriver::…. 어쩌구 한다. 그래서 소리가 문젠가? 하고 위 문장을 검색해보니 이미 있는 거고 따라가다 보니 이게 appleALC.kext오류라는 것이다. 그래서 뭔가 패치를 해야 한다고 한다. 어렵게 구글 번역으로 따라가고 있는데 아래 답변이 보인다. 해서 혹시나 해서 붙여본다. https://www.tonymacx86.com/threads/help-applealc-kernel-panic-after-catalina-update.284654/post-2019410 된다. 뭔가 조치를 했단다. 나중에 찾아 보니 내가 kext업데이트 할 때 appleALC를 업데이트 하지 않았던게 화근이었다.고 생각했다. 찾아보니 1.4.7이 있다. 업데이트 했다. 혹시 몰라 백업을 했다. 재부팅이 된다. 이런. 해서 얼른 1.4.3을 그대로 논다. 이것도 Taeyon이라는 분이 바꿔놓은 것이어서 그런걸까? 혹시하 해서 다시 찾아보지만 거기 찾아 바꾸기 패치는 적용해 봤지만 안됬다. 그럼 이 파일 뿐인가보다. AppleALC.kext.zip 잠자기가 완벽하진 않지만 다행히 재부팅은 안 된다. 아무래도 이도저도 아니어서 원래 있던 내것과 도미니크것과 합쳐봤다. acpi부터내것을 기반으로 도미니크걸로 바꿔본다. patched폴더에 내걸 지우고 도미니크걸 넣어본다. 그리고 config.plist&gt;acpi를 도미니크걸로 바꿨다. 순서까지 똑같이. 그렇지만 재부팅이 된다. SSDT-EC.amlSSDT-GPRW.amlSSDT-PM-Device.amlSSDT-PMC.amlSSDT-SMBUS.amlSSDT-TB3.aml 아 여기에 change Method(GPRW,2,N) to XPRW, pair with SSDT-GPRW.aml 이 내용을 붙여 넣었더니 키보드 마우스를 눌러도 깨어나지 않는다. 전원 버튼을 눌러야 깨어난다. 난 이게 편해서 이걸로 하기로 한다. (애들이 누를 수 있으니까) 그리고 efi&gt;driver&gt;uefi폴더 내의 드라이버들을 바꿔본다. 도미니크것과 같이 네개만 남기고 모두 지웠다. VirtualSmc.efiApfsDriverLoader-64.efiAptioMemoryFix-64.efiVBoxHfs-64.efi 이렇게 하니 패닉 해서 재부팅했지만 리포트가 나온다. 사실은 순서 바꾸는 것(acpi)을 나중에 했기 때문에 뭣 때문인지는 모르지만 여기까지 했을 때 재부팅 원인이 나왔다. 리포트가. 해서 그걸 보고 수정할 수 있었다. 보니 예전에 나온 그게 나온다. appleHDA DP드라이버 어쩌구 저쩌구 .. 찝찜했었는데.. appleALC를 1.6mb였는데 보니 1.5mb 즉, 수정이 안된 거다. 음.. 해서 바꿨다. 재부팅이 안된다. 야호.. 일단, 여기까지 만족하고 사용해보고 해봐야겠다. 어, 근데 잠자기 이후여서 그런지 모르겠지만 atom도 final cut pro도 작동이 불안하다. 되었다고 나오는데 처음 네모 파이널컷 화면도 안나오고 오류메시지도 안나오고 켜지지도 않고 그대로다. 이상하다. 패럴은 잘된다.","categories":[],"tags":[{"name":"커맥","slug":"커맥","permalink":"https://babosam.net/tags/%EC%BB%A4%EB%A7%A5/"},{"name":"재부팅","slug":"재부팅","permalink":"https://babosam.net/tags/%EC%9E%AC%EB%B6%80%ED%8C%85/"}]},{"title":"hexo-블로그엔비증","slug":"2020-03-17-today2","date":"2020-03-16T18:49:31.000Z","updated":"2020-04-04T16:34:20.897Z","comments":true,"path":"2020/03/17/2020-03-17-today2/","link":"","permalink":"https://babosam.net/2020/03/17/2020-03-17-today2/","excerpt":"","text":"이건 뭔가?1. hexo 터미널서 이상하다.정말 모를 일이다. 어제 했던게 모두 날라가버린 기분이다.나는 정말 차분하게 터미널에 이러게 쳤다. git remote -v 그런데 이렇게 나온다. 1fatal: You must specify a repository to clone. 어처구니가 없다. 그래서 이것도 해본다. hexo g -d 등등 여러가지를 해보지만 뭐 딱히 나오느게 없다. hexo init 를 해보니 이것도 오류다. not empty,...........그 뒤, s, server, new 이런 것들이 모두 hexo하나만 넣었을 때와 다를바 없이 나온다. 그러다가 테마를 바꾸는걸 따라하려고 git clone 명령어를 치자 주르륵 복사가 된다. 그 뒤론 hexo 명령어가 먹는다. 이런. 뭐지? 싶다. 2. 백업을 따라하다 길을 잃다.https://futurecreator.github.io/categories/Hexo/ 사이트의 글을 이용하여 백업을 해보려고 하고 있다. 하지만 잘 되지 않는다. 분명 따라서 git commit -a -m &#39;theme backup&#39; 을 입력했건만 untracked files:…라고 뜬다.이건 뭔가.. 그래서 구글해본다. untracked git으로.. git기초 수정하고 저장소에 저장하기 근데 여기서는 -a 옵션을 넣으면 되는것 같은데 왜 아직도 untracked…가 뜨는 건지 잘 모르겠다. 여기서 길을 잃는다. 뭔가. 이후 진행이 안된다. 그냥 넘어 가볼까? 이후에도 계속 untracked files: 목록이 나오지만 그냥 가본다. 올라가질 않는다. gitlab에. 초기에 보니 뭐라뭐라 나온다.git add .을 입력해 본다. 그리고 커밋을 해본다. 뭔가 된다. 올라갔다. 그런데 문제는 다음 것이 안된다.올라간 파일을 확인해 보니 수정했던 테마폴더가 올라가지 않았다. 이게 뭔가.. 열리지도 않는다. 로컬에서 보니 뭐라고 나온다. 1234567On branch masterYour branch is up to date with &#39;origin&#x2F;master&#39;.Changes not staged for commit: modified: themes&#x2F;hueman (modified content)no changes added to commit 막 이런다. 수정했던 것. 뭐라는건지 모르겠다. untracked &lt;-&gt; unmodified &lt;-&gt; modified &lt;-&gt; staged &lt;-&gt; commited 출처: https://mobicon.tistory.com/129 [Intelligence Convergence] 이런게 있다. modified 파일이란건데 이걸 staged로 바꿀려면 123456789101112131415161718192021222324Modified 상태의 파일을 Stage 하기 &#x2F;&#x2F; 수정하여서 Changes not staged for commit: 으로 표현된 README.md파일을 Staged 상태로 변경하기 $ git add README.md$ git status# On branch master# Changes to be committed:# (use &quot;git reset HEAD &lt;file&gt;...&quot; to unstage)## modified: README.md# new file: aa.txt#출처: https:&#x2F;&#x2F;mobicon.tistory.com&#x2F;129 [Intelligence Convergence] 인것 같은데 왜 안될까? 그뒤로 계속 해도 되지 않는다. 아마 그 테마폴더때문인것 같다. 12345678910111213141516171819$ git submodule add https:&#x2F;&#x2F;gitlab.com&#x2F;baboaqs&#x2F;hexo_themeetcAdding existing repo at &#39;hexo_themeetc&#39; to the index----------------------$ git statusOn branch masterYour branch is up to date with &#39;origin&#x2F;master&#39;.Changes to be committed: (use &quot;git reset HEAD &lt;file&gt;...&quot; to unstage) new file: .gitmodulesChanges not staged for commit: (use &quot;git add &lt;file&gt;...&quot; to update what will be committed) (use &quot;git checkout -- &lt;file&gt;...&quot; to discard changes in working directory) (commit or discard the untracked or modified content in submodules) modified: &quot;source&#x2F;_posts&#x2F;2020-03-17-\\354\\230\\244\\353\\212\\2302.md&quot; modified: themes&#x2F;hueman (modified content) 모르겠다. 초기화 하려고 해도 잘 안되는 것 같고.. 음.. 그렇다. 새로 만들고. 다시 해봐도 hello world는 뜨는데 추가하 글들이 보이지 않는다. 뭔가 문제가 있는것 같다. 암튼 그렇다. 일단 여기까지. 7시 되기 전이 자야겠다. ^^;;","categories":[],"tags":[{"name":"블로그","slug":"블로그","permalink":"https://babosam.net/tags/%EB%B8%94%EB%A1%9C%EA%B7%B8/"},{"name":"hexo","slug":"hexo","permalink":"https://babosam.net/tags/hexo/"},{"name":"오류","slug":"오류","permalink":"https://babosam.net/tags/%EC%98%A4%EB%A5%98/"}]},{"title":"첫 글 - 주저리주저리","slug":"2020-03-16-today","date":"2020-03-15T19:39:31.000Z","updated":"2020-04-04T16:32:59.079Z","comments":true,"path":"2020/03/16/2020-03-16-today/","link":"","permalink":"https://babosam.net/2020/03/16/2020-03-16-today/","excerpt":"","text":"오늘 밤의 주제는 내일 할일이다.이것 저것 한다. 이런 생각을 해봤다. 그냥 하는 것이 정당할까? 이런 글들을 쓰면서 하루 하루 사라가는 걸까? 1. 어떻게 Jekyll이나 Hugo, Ghost관련글이 하나도 없을까?참 신기한 일이다. 굉장히 노력을 했고 아니 글을 읽었고 설치하고 시놀에도 설치해봤던 기억이 있는데 이렇게 기억이 까막하다니 그리고 그 관련 글이 하나도 없다니 참 웃긴다.이렇게 나는 일을 허술하게 하나보다. 나의 삽질에 아무런 기록이 없으니 그냥 시간 낭비 내지는 그냥 했던 것들로 밖에 남지 않는다. 이런 삽질들을 좀더 기록하고 정리해야 할 필요가 있을 것 같다. 왠지 그런 시간들이 사라져 버리는 것 같으니까 말이다. 이렇게 하니 왠지 내가 늙어 버린것 같기도 하지만 사실이 그렇다. 글을 써볼까 하다가 아니 어제 달빛의 글을 읽고 간만에 여러가지 생각을 해보면서 생각을 정리해 봤다. 아직 정리된것도 아니고 좀더 다듬어야 하겠지만 아무튼 아이만이 수업이다. 이런 생각 결론이다. 이런 결론을 어떻게 내릴 수 있을지 모르겠지만 그렇다. 달빛의 글을 읽고 어떻게 보면 토론문일 수도 있고 아닐 수도 있지만 그래도 토론문 식으로 쓰는 것이 나을 것 같기도 하다. 아니 이게 중요한건 아니고 그래서 찾아 보니 내가 예전에 블로그로 걸어놨던 페이지가 워드프레스였다. 그것도 한번 날리고 나서는 여러가지 찾아본 모양인데 결국 정착한 곳이 워드프레스였던 것 같다. 그런데 약간 느린 감이 없지 않아 있다. 그래서 다른 곳도 생각해 보고 있다. http://baboaqs.gitlab.io 라는 곳에 휴고가 있었다. 2018년에 했나보다. 그리고 깃허브에 파일들이 있는 것 같긴한데 로그인이 안된다. 음.. ^^; babo@dremwiz.com 로 되어 있는 통에 그리 날라간다. 어떻게 해야 할지는 생각해 봐야겠다. gitlab 인것 같기도 하고 아리송하다. forestry.io도 찾았다. 거기에 연결되어 있었고 거기로 내가 수정을 했나보다. 그러다가 엎었던 것 같다. forestry에 가보니 드래프트된 글이 있다. hugo도 쉽지 않다라는 글이었던 것 같다. 일단 그렇다. 2. hexo를 설치해 본다. 뭔가 뜬검없는 소리다. 검색하다 보니 hexo가 있나보다. 헥손가? 엑소도 아니고 암튼 있긱래 한번 해볼까 하고 해보는데 잘 모르겠다. 포크하라고 해서 포크하고.. 따라해 본다. Gitlab Pages에 Hexo블로그 설치하기 로컬에 설치하는 건 음 뭐랄까? npm? 이걸 설치해야 하나보다. git은 이미 설치 되어 있는 것 같고 해서 찾아보니 이런 글이 있다. 맥북터미널에서 brew이용해서 node, npm설치하기 npm만 설치하고 싶었는데 모두들 node랑 같이 붙어 있는 것 같아서 그냥 그렇게 했다. 마지막 .bash_profile은 안했다. 안해도 npm -v하면 제대로 표시된다는 것과 같이 나오길래.. 로컬에 설치하고 로컬사이트 가보니 보인다.그런데 이상하게 로컬은 그림이 나오고 블로그처럼 보이는데 gitlab에거는 안보인다. 글자만 보인다. 어떻게 하지 하다가 로컬에 디플로이? hexo deploy라는 명령어를 주자 주르륵 하면서 뭔가 올리더니 다시 gitlab가보니 보인다. 허허.. 아 하기 전에 _config.yml에 사이트 url, root등을 넣어 줬다. 여기! 보고. 3. 그래서 한 번 올려볼까나? 설치하기 참고 사이트에 나온대로hexo new test해보니 파일 하나가 만들어진다. 이제 4. 몇 가지 오류들.. _config.yml 파일에 deploy 위치를 설정해야 한다. 그러지 않으면 deploy가 로컬에서만 작동한다. 1234deploy: type: git repo: https:&#x2F;&#x2F;gitlab.com&#x2F;baboaqs&#x2F;hexo.git branch : master 뭔갈 더 설치해야 한다.(출처:미니블로그)npm install hexo-deployer-git --save 프로젝트 보호 풀기 https://gitlab.com/baboaqs/hexo.git12345678910111213 ! [remote rejected] HEAD -&gt; master (pre-receive hook declined)error: failed to push some refs to &#39;https:&#x2F;&#x2F;gitlab.com&#x2F;baboaqs&#x2F;hexo.git&#39;FATAL Something&#39;s wrong. Maybe you can find the solution here: https:&#x2F;&#x2F;hexo.io&#x2F;docs&#x2F;troubleshooting.htmlError: Spawn failed at ChildProcess.&lt;anonymous&gt; (&#x2F;Users&#x2F;babomac&#x2F;blog&#x2F;node_modules&#x2F;hexo-util&#x2F;lib&#x2F;spawn.js:51:21) at ChildProcess.emit (events.js:315:20) at Process.ChildProcess._handle.onexit (internal&#x2F;child_process.js:275:12) 뭐 이런 오류가 나온다. 해서 자란베이스 에서 하라는대로setting>Repository>Protected Branches>master줄에 있는 unprotect 버튼을 눌러줬다. 뭔가 이상하다. 이상한 파일들이 올라가버렸다. ^^;;;;;;","categories":[],"tags":[{"name":"첫글","slug":"첫글","permalink":"https://babosam.net/tags/%EC%B2%AB%EA%B8%80/"},{"name":"블로그","slug":"블로그","permalink":"https://babosam.net/tags/%EB%B8%94%EB%A1%9C%EA%B7%B8/"},{"name":"hexo","slug":"hexo","permalink":"https://babosam.net/tags/hexo/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-03-15T19:15:03.934Z","updated":"2020-03-15T19:15:03.934Z","comments":true,"path":"2020/03/16/hello-world/","link":"","permalink":"https://babosam.net/2020/03/16/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"포스트하는법","slug":"aboutpost","date":"2020-03-15T15:00:00.000Z","updated":"2020-03-15T20:05:55.697Z","comments":true,"path":"2020/03/16/aboutpost/","link":"","permalink":"https://babosam.net/2020/03/16/aboutpost/","excerpt":"","text":"1234567891011---title: Github 블로그 만들기 with Hexo - 글쓰기date: 1555241000000tags: []categories: []thumbnail: &quot;&quot;permalink: &quot;&quot;---&lt;!-- excerpt --&gt;&lt;!-- toc --&gt; 출처: 밍피디","categories":[],"tags":[]}]}